{
  "info": {
    "notes": "Students with credit for CMPT 102, 128, 130 or 166 may not take this course for further credit. Students who have taken CMPT 125, 129, 130 or 135 first may not then take this course for further credit.",
    "deliveryMethod": "In Person",
    "description": "An elementary introduction to computing science and computer programming, suitable for students with little or no programming background. Students will learn fundamental concepts and terminology of computing science, acquire elementary skills for programming in a high-level language and be exposed to diverse fields within, and applications of computing science. Topics will include: pseudocode, data types and control structures, fundamental algorithms, computability and complexity, computer architecture, and history of computing science. Treatment is informal and programming is presented as a problem-solving tool. ",
    "section": "D100",
    "units": "3",
    "title": "Introduction to Computing Science and Programming I",
    "type": "e",
    "classNumber": "6207",
    "departmentalUgradNotes": "",
    "prerequisites": "BC Math 12 or equivalent is recommended.",
    "number": "120",
    "requiredReadingNotes": "",
    "registrarNotes": "<p><strong>ACADEMIC INTEGRITY: YOUR WORK, YOUR SUCCESS</strong></p>\r\n<p>SFU&rsquo;s Academic Integrity web site&nbsp;<a href=\"http://www.sfu.ca/students/academicintegrity.html\">http://www.sfu.ca/students/academicintegrity.html</a>&nbsp;is filled with information on what is meant by academic dishonesty, where you can find resources to help with your studies and the consequences of cheating.&nbsp; Check out the site for more information and videos that help explain the issues in plain English.</p>\r\n<p>Each student is responsible for his or her conduct as it affects the University community.&nbsp; Academic dishonesty, in whatever form, is ultimately destructive of the values of the University. Furthermore, it is unfair and discouraging to the majority of students who pursue their studies honestly. Scholarly integrity is required of all members of the University.&nbsp;<a href=\"http://www.sfu.ca/policies/gazette/student/s10-01.html\">http://www.sfu.ca/policies/gazette/student/s10-01.html</a></p>\r\n<p><strong>TEACHING AT SFU IN FALL 2020</strong></p>\r\n<p>Teaching at SFU in fall 2020 will be conducted primarily through remote methods. There will be in-person course components in a few exceptional cases where this is fundamental to the educational goals of the course. Such course components will be clearly identified at registration, as will course components that will be &ldquo;live&rdquo; (synchronous) vs. at your own pace (asynchronous). Enrollment acknowledges that remote study may entail different modes of learning, interaction with your instructor, and ways of getting feedback on your work than may be the case for in-person classes. To ensure you can access all course materials, we recommend you have access to a computer with a microphone and camera, and the internet. In some cases your instructor may use Zoom or other means requiring a camera and microphone to invigilate exams. If proctoring software will be used, this will be confirmed in the first week of class.</p>\r\nStudents with hidden or visible disabilities who believe they may need class or exam accommodations, including in the current context of remote learning, are encouraged to register with the <a href=\"http://www.sfu.ca/students/accessible-learning.html\">SFU Centre for Accessible Learning</a> (<a href=\"mailto:caladmin@sfu.ca\">caladmin@sfu.ca</a> or 778-782-3112).",
    "outlinePath": "2020/fall/cmpt/120/d100",
    "term": "Fall 2020",
    "corequisites": "",
    "dept": "CMPT",
    "degreeLevel": "UGRD",
    "specialTopic": "",
    "courseDetails": "<p>For this Fall 2020 semester, all course components (lectures, assignments, and exams) will be in an online format. Students must have access to a computer with internet access, allowing the use of a conferencing system such as Zoom or BB Collaborate Ultra. Some components of the course will require synchronous (real-time) participation during the scheduled lecture and/or exam times. Visual proctoring may be required, subject to university approval. All the course information and communication will be centralized in the Canvas course website, including materials, assignments, and a discussion forum. Students should organize their Canvas settings to be notified when announcements are posted. CMPT 120 PLACEMENT TEST &ndash; do you have enough computing knowledge to pass our placement test? Have you taken Computing Science courses in High School or elsewhere? Have you worked in a business or volunteered as a computer programmer? Have you written programs of 200-300 lines of code or more? IF YES, you may NOT have to take CMPT 120 and could enroll directly into the next required courses &ndash; CMPT 125 and 127. Challenge yourself and take our placement test. https://courses.cs.sfu.ca/forms/cmpt-cmpt-120-placement-test/ IF NO &ndash; please go ahead and enroll in CMPT 120.</p>\r\n<br /><br />\r\n<h2 class=\"ParagraphTitle\">Topics</h2>\r\n<ul>\r\n<li>Algorithms and computational thinking</li>\r\n<li>Procedural programming in Python</li>\r\n<li>Data types and control structures</li>\r\n<li>Application areas within computing science</li>\r\n<li>Fundamental algorithms, including searching, sorting, basics of recursion</li>\r\n<li>Computability and complexity, introduction</li>\r\n<li>Basics of binary encoding</li>\r\n</ul>",
    "materials": "<h2 class=\"ParagraphTitle\">Reference Books</h2>\r\n<ul>\r\n<li>Computer Science Illuminated, 7th edition, Nell Dale, John Lewis, Jones &amp; Bartlett, 2020, 9781284155617, The 6th edition full text is available online via the SFU Library</li>\r\n<li>Starting out with Programming Logic and Design, Tony Gaddis, Pearson, 2016, 9780133985078, Available on reserves at the SFU library</li>\r\n<li>Starting Out with Python-4th Edition, Tony Gaddis, Pearson, 2018, 9780134543666, Available on reserves at the SFU library</li>\r\n</ul>",
    "name": "CMPT 120 D100",
    "designation": "Quantitative/Breadth-Science"
  },
  "instructor": [
    {
      "profileUrl": "",
      "commonName": "Diana",
      "firstName": "Diana Raquel",
      "lastName": "Cukierman",
      "phone": "1 778 782-7110",
      "roleCode": "PI",
      "name": "Diana Cukierman",
      "officeHours": "",
      "office": "",
      "email": "diana@sfu.ca"
    }
  ],
  "courseSchedule": [
    {
      "roomNumber": "LEARNING",
      "endDate": "Tue Dec 08 00:00:00 PST 2020",
      "campus": "Burnaby",
      "buildingCode": "REMOTE",
      "days": "Mo, We, Fr",
      "sectionCode": "LEC",
      "startTime": "10:30",
      "isExam": false,
      "endTime": "11:20",
      "startDate": "Wed Sep 09 00:00:00 PDT 2020"
    }
  ],
  "examSchedule": [
    {
      "roomNumber": "LEARNING",
      "endDate": "Fri Dec 11 00:00:00 PST 2020",
      "campus": "Burnaby",
      "buildingCode": "REMOTE",
      "days": "Fr",
      "startTime": "8:30",
      "isExam": true,
      "endTime": "11:30",
      "startDate": "Fri Dec 11 00:00:00 PST 2020"
    }
  ],
  "grades": [
    {
      "description": "There will be assignments and multiple quizzes/exams. A more detailed marking scheme will be provided in the first class of the semester.  Students must attain an overall passing grade on the weighted average of exams in the course in order to obtain a clear pass (C- or better).",
      "weight": "100"
    }
  ],
  "requiredText": [
    {
      "details": "Think Python - How to Think Like a Computer Scientist: Interactive Edition https://runestone.academy/runestone/books/published/thinkcspy/index.html,"
    }
  ]
}
